[
    {
        "event": {
            "type": "Overtake",
            "timestamp": 10.877,
            "description": "Driver 18 overtakes driver 27 to position 19"
        },
        "commentary": "\"OH, THE BATTLE FOR 19TH PLACE IS ON! LANCE STROLL, THE YOUNG GUN, IS ON A MISSION! HE'S BEEN HURDLING TOWARDS HÜLKBERG ALL LAP, AND FINALLY, HE MAKES HIS MOVE! STROLL GETS A RUN ON THE OUTSIDE OF TURN 9, AND HÜLKBERG JUST CAN'T DEFEND! THE PASS IS MADE, AND STROLL TAKES 19TH PLACE! THE CROWD IS ON THE EDGE OF THEIR SEATS AS STROLL PULL"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 205.169,
            "description": "Driver 2 overtakes driver 3 to position 14"
        },
        "commentary": "\"OH, THE BATTLE FOR 14TH IS ON! LOGAN SARGEANT, THE YOUNG GUN, PULLS OFF A STUNNING MOVE ON DANIEL RICCIARDO! THE AMERICAN DRIVER SEES AN OPENING AND TAKES IT WITH BOTH HANDS! HE'S GOT THE BIT BETWEEN HIS TEETH NOW!\n\nRicciardo, struggling for pace, tries to hold on, but Sargeant is having none of it! He's got the momentum, he's got the skill, AND HE'S GOT THE PASS! THE CROW"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 298.628,
            "description": "Driver 4 overtakes driver 14 to position 6"
        },
        "commentary": "\"OH, WHAT A MOVE! Lando Norris is going for it! He's been sizing up Fernando Alonso for lap after lap, and NOW HE'S MADE HIS MOVE! Norris dives down the inside, BRAKES LATER THAN ANYONE HAS ANY RIGHT TO, AND TAKES THE POSITION! Alonso tried to defend, but Norris was having NONE OF IT! The McLaren man is up to P6, and that's a MASSIVE OVERTAKE! The crowd is on their FEET, folks! Norris is ON A ROLL!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 504.338,
            "description": "Driver 18 overtakes driver 77 to position 18"
        },
        "commentary": "\"OH, THE BATTLE FOR 18th PLACE IS ON! Lance Stroll is on the charge, folks! He's been sizing up Valtteri Bottas for laps, and finally, he's made his move! Stroll dive-bombs the inside of Bottas at Turn 3, and it's a beautifully executed pass! The Canadian youngster has got the bit between his teeth, and he's not letting go! Bottas tried to defend, but Stroll was having none of it! He's through, and he's taken 18th place! This is turning out to"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 686.075,
            "description": "Driver 11 overtakes driver 16 to position 3"
        },
        "commentary": "\"OH, THE BATTLE FOR THE PODIUM INTENSIFIES! Sergio Perez is ON THE MOVE! He's been sizing up Charles Leclerc for lap after lap, and NOW HE MAKES HIS MOVE! A dazzling display of precision driving, Perez dives down the inside of Leclerc, and IT'S A DONE DEAL! He's got the position! The Mexican maestro takes third place, leaving Leclerc to settle for fourth! What a masterclass of overtaking, Perez has got the pace and the skill to make it happen! The crowd is on the edge of"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 897.989,
            "description": "Driver 2 overtakes driver 24 to position 13"
        },
        "commentary": "\"AND THERE IT IS! LOGAN SARGEANT WITH THE MOVE OF THE RACE SO FAR! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE DOES! HE SLIPS STREAMED ZHOU GUANYU COMING OUT OF TURN 3 AND TAKES THE INSIDE LINE INTO TURN 4! THE CROWD IS ON ITS FEET AS SARGEANT COMPLETES THE PASS AND TAKES 13TH PLACE! THE YOUNG AMERICAN IS ON A MI"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 898.795,
            "description": "Driver 3 overtakes driver 24 to position 14"
        },
        "commentary": "\"OH, THE HUNTER STRIKES! Daniel Ricciardo, the Honey Badger, has been stalking Zhou Guanyu for laps, and finally, he's made his move! A masterclass of patience and precision, Ricciardo has squeezed past the Alfa Romeo at the apex of turn 7! The Australian's got the bit between his teeth now, and he's not looking back! From 15th to 14th, Ricciardo's on the charge! The Renault is flying, and the crowd is on their feet! What a move, what a"
    }
]
